import React from 'react';

const Article = () => {
    // Static Data
    const headlinePhoto = "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRa6143OgGeMmgqsMFN5hXzIvEC0xWrlrVNrA&s"; 
    const headline = "ગુજરાતમાં ધોરણ 10ની પરીક્ષાનું પરિણામ જાહેર";
    const fullNews = "ગુજરાત રાજ્યની શૈક્ષણિક પરિણામોની ઉજવણીને ધ્યાનમાં રાખતાં, આ વર્ષે ધોરણ 10ની પરીક્ષામાં ઘણાં વિદ્યાર્થીઓએ ઉમદા પ્રદર્શન કર્યું છે.રાજ્યના વિવિધ જિલ્લાઓમાં વિદ્યાર્થીઓએ ઉત્તમ ગુણ મેળવ્યા, જે જાગૃતિ અને શૈક્ષણિક પ્રગતિને દર્શાવે છે.આ પરિણામો માત્ર આ વર્ષેના પરિણામો નથી, પરંતુ વિદ્યાર્થીઓની સતત મહેનત અને વિદ્યાર્થીઓ માટે સુવિધા પૂરી પાડવામાં આવતા શ્રેષ્ઠ શિક્ષણનાં પરિણામો છે.આ પરિણામો તેમના સપનાઓને સાકાર કરવામાં અને ઉચ્ચ શિક્ષણ માટે નવા માર્ગો નિર્માણ કરવામાં મદદ કરશે. શાળા શિક્ષકો દ્વારા વિદ્યાર્થીઓની સફળતાને લઈ કરવામાં આવેલા અભિનંદન અને પ્રોત્સાહનથી, વિદ્યાર્થીઓએ આ વર્ષે શાળા અને પરિવાર માટે શાનને વધારવાની ખાતરી કરી છે.શિક્ષકો અને સંચાલકોએ વિશેષ નોંધ લીધું કે, 92 % સફળતાનો ટકાવાર દર્શાવે છે કે, આ વર્ષે વિદ્યાર્થીઓએ મેડિકલ અને ઈજનેરીના ક્ષેત્રમાં આગળ વધવા માટે ઉચ્ચ ગુણ પ્રાપ્ત કર્યા છે.આ સમયે, શિક્ષણ વિભાગે આ વર્ષે શૈક્ષણિક અભિગમ અને કાર્યપદ્ધતિઓને સુધારવા માટે નવી યોજનાઓને લાગુ કરવાના પ્રસ્તાવ પર વિચાર કર્યો છે.વિદ્યાર્થીઓ અને તેમના માતા - પિતાઓ માટે આ સફળતા એક શુભ સંકેત છે, જે તેઓ માટે કૌશલ્ય વિકાસ અને ઊંચા શિક્ષણની શોધમાં મથન કરવાનો સમય છે.વધુમાં, દરેક સફળતાનો જશ્ન મનાવવા માટે શિક્ષણ વિભાગે વધતી જતી જાગૃતિ વધારવા માટે ખાસ કાર્યક્રમો યોજવાનો વિચાર કર્યો છે, જેમાં તેમના શાળાના પ્રતિનિધિઓને પણ આમંત્રિત કરવામાં આવશે.આ કાર્યક્રમો વિદ્યાર્થીઓને તેમના ભવિષ્યના અભ્યાસ અને વ્યવસાયને લગતી માહિતી અને માર્ગદર્શન પૂરૂ પાડશે."

    return (
        <div className="p-4 sm:ml-96 sm:mr-96 bg-gray-600">
            <div className="p-4 bg-gray-700 mt-14  ">

                {headline && (
                    <h1 className="text-xl font-bold text-white mb-2" style={{ letterSpacing: '0.1em' }}>{headline}</h1>
                )}



                {/* Headline Photo */}
                {headlinePhoto && (
                    <div className="mb-4">
                        <img
                            src={headlinePhoto}
                            alt="Headline"
                            className="w-full h-64 object-cover "
                        />
                    </div>
                )}

                {/* Headline */}

                {/* Full News */}
                <div className="text-white" style={{ letterSpacing: '0.1em' }} >
                    {fullNews ? (
                        <p className="text-lg">{fullNews}</p>
                    ) : (
                        <p>No news available at the moment.</p>
                    )}
                </div>
            </div>
        </div>
    );
}

export default Article;